Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleEffectType
Defines what the effect of a handle is.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleEffectType.Geometry
The handle modifies the geometry by changing input points.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleEffectType.Property
The handle modifies any object properties,
or the handle modifies both object properties and input points.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleEffectType.Addition
The handle makes additions to the geometry when clicked.